7767517
297 360
Input                    in0                      0 1 in0
Convolution              conv_85                  1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_17                  1 1 1 2
Convolution              conv_86                  1 1 2 3 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_18                  1 1 3 4
Convolution              conv_87                  1 1 4 5 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_19                  1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,16,16 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_88                  1 1 11 12 0=8 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Swish                    silu_20                  1 1 12 13
Convolution              conv_89                  1 1 13 14 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152
Split                    splitncnn_1              1 2 14 15 16
Sigmoid                  sigmoid_5                1 1 16 17
BinaryOp                 mul_0                    2 1 15 17 18 0=2
BinaryOp                 add_1                    2 1 10 18 19 0=0
Concat                   cat_0                    3 1 7 9 19 20 0=0
Convolution              conv_90                  1 1 20 21 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=3072
Swish                    silu_21                  1 1 21 22
Convolution              conv_91                  1 1 22 23 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_22                  1 1 23 24
Convolution              conv_92                  1 1 24 25 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_23                  1 1 25 26
Slice                    split_1                  1 2 26 27 28 -23300=2,32,32 1=0
Split                    splitncnn_2              1 3 28 29 30 31
Convolution              conv_93                  1 1 31 32 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_24                  1 1 32 33
Convolution              conv_94                  1 1 33 34 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Split                    splitncnn_3              1 2 34 35 36
Sigmoid                  sigmoid_6                1 1 36 37
BinaryOp                 mul_2                    2 1 35 37 38 0=2
BinaryOp                 add_3                    2 1 30 38 39 0=0
Concat                   cat_1                    3 1 27 29 39 40 0=0
Convolution              conv_95                  1 1 40 41 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_25                  1 1 41 42
Split                    splitncnn_4              1 2 42 43 44
Convolution              conv_96                  1 1 44 45 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_26                  1 1 45 46
Convolution              conv_97                  1 1 46 47 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_27                  1 1 47 48
Slice                    split_2                  1 2 48 49 50 -23300=2,64,64 1=0
Split                    splitncnn_5              1 3 50 51 52 53
Convolution              conv_98                  1 1 53 54 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Convolution              conv_99                  1 1 52 55 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_28                  1 1 54 56
Split                    splitncnn_6              1 2 56 57 58
Swish                    silu_29                  1 1 55 59
Convolution              conv_100                 1 1 58 60 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_30                  1 1 60 61
Convolution              conv_101                 1 1 61 62 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_7              1 2 62 63 64
Sigmoid                  sigmoid_7                1 1 64 65
BinaryOp                 mul_4                    2 1 63 65 66 0=2
BinaryOp                 add_5                    2 1 57 66 67 0=0
Split                    splitncnn_8              1 2 67 68 69
Convolution              conv_102                 1 1 69 70 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_31                  1 1 70 71
Convolution              conv_103                 1 1 71 72 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_9              1 2 72 73 74
Sigmoid                  sigmoid_8                1 1 74 75
BinaryOp                 mul_6                    2 1 73 75 76 0=2
BinaryOp                 add_7                    2 1 68 76 77 0=0
Concat                   cat_2                    2 1 77 59 78 0=0
Convolution              conv_104                 1 1 78 79 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_32                  1 1 79 80
Concat                   cat_3                    3 1 49 51 80 81 0=0
Convolution              conv_105                 1 1 81 82 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_33                  1 1 82 83
Split                    splitncnn_10             1 2 83 84 85
Convolution              conv_106                 1 1 85 86 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_34                  1 1 86 87
Convolution              conv_107                 1 1 87 88 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_35                  1 1 88 89
Slice                    split_3                  1 2 89 90 91 -23300=2,128,128 1=0
Split                    splitncnn_11             1 3 91 92 93 94
Convolution              conv_108                 1 1 94 95 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_109                 1 1 93 96 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_36                  1 1 95 97
Split                    splitncnn_12             1 2 97 98 99
Swish                    silu_37                  1 1 96 100
Convolution              conv_110                 1 1 99 101 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_38                  1 1 101 102
Convolution              conv_111                 1 1 102 103 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_13             1 2 103 104 105
Sigmoid                  sigmoid_9                1 1 105 106
BinaryOp                 mul_8                    2 1 104 106 107 0=2
BinaryOp                 add_9                    2 1 98 107 108 0=0
Split                    splitncnn_14             1 2 108 109 110
Convolution              conv_112                 1 1 110 111 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_39                  1 1 111 112
Convolution              conv_113                 1 1 112 113 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_15             1 2 113 114 115
Sigmoid                  sigmoid_10               1 1 115 116
BinaryOp                 mul_10                   2 1 114 116 117 0=2
BinaryOp                 add_11                   2 1 109 117 118 0=0
Concat                   cat_4                    2 1 118 100 119 0=0
Convolution              conv_114                 1 1 119 120 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_40                  1 1 120 121
Concat                   cat_5                    3 1 90 92 121 122 0=0
Convolution              conv_115                 1 1 122 123 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_41                  1 1 123 124
Convolution              conv_116                 1 1 124 125 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_42                  1 1 125 126
Split                    splitncnn_16             1 2 126 127 128
Pooling                  maxpool2d_2              1 1 128 129 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_17             1 2 129 130 131
Pooling                  maxpool2d_3              1 1 131 132 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_18             1 2 132 133 134
Pooling                  maxpool2d_4              1 1 134 135 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_6                    4 1 127 130 133 135 136 0=0
Convolution              conv_117                 1 1 136 137 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_43                  1 1 137 138
Convolution              conv_118                 1 1 138 139 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_44                  1 1 139 140
Slice                    split_4                  1 2 140 141 142 -23300=2,128,128 1=0
Split                    splitncnn_19             1 2 142 143 144
Convolution              conv_119                 1 1 144 145 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Reshape                  reshape_169              1 1 145 146 0=400 1=128 2=2
Slice                    split_5                  1 3 146 147 148 149 -23300=3,32,32,64 1=1
Split                    splitncnn_20             1 2 149 150 151
Permute                  permute_166              1 1 147 152 0=1
Reshape                  reshape_170              1 1 150 153 0=20 1=20 2=128
MatMul                   matmul_178               2 1 152 148 154
ConvolutionDepthWise     convdw_180               1 1 153 155 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
BinaryOp                 mul_12                   1 1 154 156 0=2 1=1 2=0.17677669
Softmax                  softmax_83               1 1 156 157 0=2 1=1
MatMul                   matmultransb_0           2 1 151 157 158 0=1
Reshape                  reshape_171              1 1 158 159 0=20 1=20 2=128
BinaryOp                 add_13                   2 1 159 155 160 0=0
Convolution              conv_120                 1 1 160 161 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
BinaryOp                 add_14                   2 1 143 161 162 0=0
Split                    splitncnn_21             1 2 162 163 164
Convolution              conv_121                 1 1 164 165 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_45                  1 1 165 166
Convolution              conv_122                 1 1 166 167 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
BinaryOp                 add_15                   2 1 163 167 168 0=0
Concat                   cat_7                    2 1 141 168 169 0=0
Convolution              conv_123                 1 1 169 170 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_46                  1 1 170 171
Split                    splitncnn_22             1 2 171 172 173
Interp                   interpolate_0            1 1 173 174 0=1 1=2.0 2=2.0 6=0
Concat                   cat_8                    2 1 174 84 175 0=0
Convolution              conv_124                 1 1 175 176 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_47                  1 1 176 177
Slice                    split_6                  1 2 177 178 179 -23300=2,64,64 1=0
Split                    splitncnn_23             1 3 179 180 181 182
Convolution              conv_125                 1 1 182 183 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_48                  1 1 183 184
Convolution              conv_126                 1 1 184 185 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Split                    splitncnn_24             1 2 185 186 187
Sigmoid                  sigmoid_11               1 1 187 188
BinaryOp                 mul_16                   2 1 186 188 189 0=2
BinaryOp                 add_17                   2 1 181 189 190 0=0
Concat                   cat_9                    3 1 178 180 190 191 0=0
Convolution              conv_127                 1 1 191 192 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_49                  1 1 192 193
Split                    splitncnn_25             1 2 193 194 195
Interp                   interpolate_1            1 1 195 196 0=1 1=2.0 2=2.0 6=0
Concat                   cat_10                   2 1 196 43 197 0=0
Convolution              conv_128                 1 1 197 198 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_50                  1 1 198 199
Slice                    split_7                  1 2 199 200 201 -23300=2,32,32 1=0
Split                    splitncnn_26             1 3 201 202 203 204
Convolution              conv_129                 1 1 204 205 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Swish                    silu_51                  1 1 205 206
Convolution              conv_130                 1 1 206 207 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=4608
Split                    splitncnn_27             1 2 207 208 209
Sigmoid                  sigmoid_12               1 1 209 210
BinaryOp                 mul_18                   2 1 208 210 211 0=2
BinaryOp                 add_19                   2 1 203 211 212 0=0
Concat                   cat_11                   3 1 200 202 212 213 0=0
Convolution              conv_131                 1 1 213 214 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_52                  1 1 214 215
Split                    splitncnn_28             1 3 215 216 217 218
Convolution              conv_132                 1 1 217 219 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Convolution              conv_133                 1 1 216 220 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
ConvolutionDepthWise     convdw_181               1 1 218 221 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Swish                    silu_53                  1 1 219 222
Swish                    silu_54                  1 1 220 223
Swish                    silu_55                  1 1 221 224
Concat                   cat_12                   2 1 222 194 225 0=0
Convolution              conv_134                 1 1 223 226 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_135                 1 1 224 227 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Convolution              conv_136                 1 1 225 228 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_56                  1 1 226 229
Swish                    silu_57                  1 1 227 230
Swish                    silu_58                  1 1 228 231
Convolution              conv_137                 1 1 229 232 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_182               1 1 230 233 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Slice                    split_8                  1 2 231 234 235 -23300=2,64,64 1=0
Split                    splitncnn_29             1 3 235 236 237 238
Convolution              conv_138                 1 1 238 239 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_59                  1 1 233 240
Convolution              conv_139                 1 1 240 241 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_60                  1 1 239 242
Convolution              conv_140                 1 1 242 243 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Split                    splitncnn_30             1 2 243 244 245
Swish                    silu_61                  1 1 241 246
Sigmoid                  sigmoid_13               1 1 245 247
Convolution              conv_141                 1 1 246 248 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128
Concat                   cat_13                   2 1 232 248 249 0=0
BinaryOp                 mul_20                   2 1 244 247 250 0=2
BinaryOp                 add_21                   2 1 237 250 251 0=0
Reshape                  reshape_172              1 1 249 252 0=6400 1=66
Concat                   cat_14                   3 1 234 236 251 253 0=0
Convolution              conv_142                 1 1 253 254 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_62                  1 1 254 255
Split                    splitncnn_31             1 3 255 256 257 258
Convolution              conv_143                 1 1 257 259 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Convolution              conv_144                 1 1 256 260 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
ConvolutionDepthWise     convdw_183               1 1 258 261 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=1152 7=128
Swish                    silu_63                  1 1 259 262
Swish                    silu_64                  1 1 260 263
Swish                    silu_65                  1 1 261 264
Concat                   cat_15                   2 1 262 172 265 0=0
Convolution              conv_145                 1 1 263 266 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_146                 1 1 264 267 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_147                 1 1 265 268 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_66                  1 1 266 269
Swish                    silu_67                  1 1 267 270
Swish                    silu_68                  1 1 268 271
Convolution              conv_148                 1 1 269 272 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_184               1 1 270 273 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Slice                    split_9                  1 2 271 274 275 -23300=2,128,128 1=0
Split                    splitncnn_32             1 3 275 276 277 278
Convolution              conv_149                 1 1 278 279 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Convolution              conv_150                 1 1 277 280 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_69                  1 1 273 281
Convolution              conv_151                 1 1 281 282 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_70                  1 1 279 283
Split                    splitncnn_33             1 2 283 284 285
Swish                    silu_71                  1 1 280 286
Convolution              conv_152                 1 1 285 287 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_72                  1 1 282 288
Convolution              conv_153                 1 1 288 289 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128
Swish                    silu_73                  1 1 287 290
Concat                   cat_16                   2 1 272 289 291 0=0
Convolution              conv_154                 1 1 290 292 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_34             1 2 292 293 294
Reshape                  reshape_173              1 1 291 295 0=1600 1=66
Sigmoid                  sigmoid_14               1 1 294 296
BinaryOp                 mul_22                   2 1 293 296 297 0=2
BinaryOp                 add_23                   2 1 284 297 298 0=0
Split                    splitncnn_35             1 2 298 299 300
Convolution              conv_155                 1 1 300 301 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_74                  1 1 301 302
Convolution              conv_156                 1 1 302 303 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_36             1 2 303 304 305
Sigmoid                  sigmoid_15               1 1 305 306
BinaryOp                 mul_24                   2 1 304 306 307 0=2
BinaryOp                 add_25                   2 1 299 307 308 0=0
Concat                   cat_17                   2 1 308 286 309 0=0
Convolution              conv_157                 1 1 309 310 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_75                  1 1 310 311
Concat                   cat_18                   3 1 274 276 311 312 0=0
Convolution              conv_158                 1 1 312 313 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_76                  1 1 313 314
Split                    splitncnn_37             1 2 314 315 316
Convolution              conv_159                 1 1 315 317 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
ConvolutionDepthWise     convdw_185               1 1 316 318 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304 7=256
Swish                    silu_77                  1 1 317 319
Swish                    silu_78                  1 1 318 320
Convolution              conv_160                 1 1 319 321 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Convolution              conv_161                 1 1 320 322 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_79                  1 1 321 323
Swish                    silu_80                  1 1 322 324
Convolution              conv_162                 1 1 323 325 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
ConvolutionDepthWise     convdw_186               1 1 324 326 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=576 7=64
Swish                    silu_81                  1 1 326 327
Convolution              conv_163                 1 1 327 328 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_82                  1 1 328 329
Convolution              conv_164                 1 1 329 330 0=2 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=128
Concat                   cat_19                   2 1 325 330 331 0=0
Reshape                  reshape_174              1 1 331 332 0=400 1=66
Concat                   cat_20                   3 1 252 295 332 333 0=1
Slice                    split_10                 1 2 333 334 335 -23300=2,64,2 1=0
Reshape                  reshape_175              1 1 334 336 0=8400 1=16 2=4
Sigmoid                  sigmoid_16               1 1 335 337
Permute                  permute_168              1 1 336 338 0=2
Softmax                  softmax_84               1 1 338 339 0=0 1=1
Convolution              conv_165                 1 1 339 340 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  reshape_176              1 1 340 341 0=8400 1=4
Slice                    tensor_split_0           1 2 341 342 343 -23300=2,2,-233 1=0
MemoryData               /model.23/Constant_9_output_0 0 1 344 0=8400 1=2
BinaryOp                 sub_26                   2 1 344 342 345 0=1
Split                    splitncnn_38             1 2 345 346 347
MemoryData               /model.23/Constant_10_output_0 0 1 348 0=8400 1=2
BinaryOp                 add_27                   2 1 348 343 349 0=0
Split                    splitncnn_39             1 2 349 350 351
BinaryOp                 sub_28                   2 1 350 346 352 0=1
BinaryOp                 add_29                   2 1 347 351 353 0=0
BinaryOp                 div_30                   1 1 353 354 0=3 1=1 2=2.0
Concat                   cat_21                   2 1 354 352 355 0=0
MemoryData               /model.23/Constant_12_output_0 0 1 356 0=8400
Reshape                  reshape_177              1 1 356 357 0=8400 1=1
BinaryOp                 mul_31                   2 1 355 357 358 0=2
Concat                   cat_22                   2 1 358 337 out0 0=0
